--Eating Disorders--
'{
    "q1": "Do you experience a sense of a "loss of control" over your eating? 
    This can mean feeling unable to stop eating once you've started, 
    or eating an amount of food that feels objectively large in a discrete period of time.",
    //if yes: BINGEEATING -> q1a
    //if no: q2
    "q1a":"Following these episodes of loss-of-control eating, do you engage in recurrent, inappropriate "compensatory behaviors" to prevent weight gain? 
    (e.g., self-induced vomiting, misuse of laxatives/diuretics/enemas, fasting, or excessive exercise).",
    //if yes: BULIMIA_NERVOSA
    //if no: Binge eating disorder
    "q2": "Despite being at a significantly low weight, is there an intense fear of gaining weight and a disturbed perception of your body 
    (e.g., seeing yourself as fat, or your self-worth being overly tied to your weight)?",
    //If YES:** This aligns with the core criteria for **Anorexia Nervosa**. A sub-type would then be determined (Restricting type or Binge-Eating/Purging type).
   //If NO:** The significant weight loss without the characteristic fear of weight gain may indicate **ARFID** or another medical condition, and a medical evaluation is crucial.
   "q3": "Do you engage in compensatory behaviors (like self-induced vomiting, laxative misuse, or excessive exercise) to control your weight or shape, 
   but these occur after eating normal or small amounts of food (and not as a compensation for a binge)?",
   //If YES: This pattern aligns with the diagnosis of Purging Disorder.
   "q4":"Do you chew and then spit out food instead of swallowing it to avoid calorie intake or due to fears about the food?",
    //If YES: This is a recognized disordered behavior that may be part of another eating disorder or classified under OSFED.
    "q5":" Are the primary concerns about food and eating related to avoidance based on sensory characteristics (texture, smell), a lack of interest in eating, or a fear of negative consequences like choking or vomiting—rather than a concern about body weight or shape?",
    //If YES: This pattern strongly points to Avoidant/Restrictive Food Intake Disorder (ARFID).
    "q6": "Do your thoughts and behaviors around food, weight, and body image cause you significant distress and impair your life, but do not fully match the patterns described above? (For example, all the symptoms of Anorexia Nervosa but weight is not in the "significantly low" range, or all the symptoms of Bulimia Nervosa but at a lower frequency).",
    //If YES: This is incredibly common and falls under the diagnostic category of Other Specified Feeding or Eating Disorder (OSFED). It is no less serious or deserving of treatment than the more specifically named disorders.
}'
--SEXUAL_DISORDERS--'
{

        "initial_question": "What is the main category of your sexual concern?",
        "categories": {
            "desire_arousal": "Problems with Sexual Desire, Interest, or Arousal",
            "orgasm": "Problems with Orgasm",
            "pain": "Problems with Sexual Pain",
            "male_ejaculation": "Problems with Ejaculation (for men)"
        },
        
        "questions": {
            "q1": "Is the primary issue a persistent deficiency or absence of sexual/erotic thoughts, fantasies, and/or desire for sexual activity?",
            "q1a": "Is the primary issue a difficulty obtaining or maintaining adequate genital responses (e.g., erection in men, lubrication/swelling in women) until completion of sexual activity, despite sufficient desire?",
            
            "q2": "Is there a marked delay in, infrequency of, or absence of orgasm? Or is orgasm significantly reduced in intensity, even with adequate stimulation and desire?",
            "q2a": "Is the concern about orgasms occurring too rapidly and without control, often before or shortly after penetration (or minimal stimulation), leading to distress?",
            "q2b": "Does this early ejaculation/orgasm occur persistently and in almost all situations?",
            
            "q3": "Is the primary problem persistent or recurrent genital pain associated with sexual intercourse?",
            "q3a": "Is the pain experienced primarily during or after vaginal penetration?",
            "q3b": "Is the pain described as a burning, aching, or 'cutting' pain that makes penetration difficult or impossible, often with fear of pain leading to vaginal muscle tension?",
            
            "q4": "Is the primary concern a delayed, absent, or reduced-intensity ejaculation, despite adequate stimulation and desire?",
            "q4a": "Is the primary concern about ejaculation and orgasm occurring too rapidly and without control?"
        },
        
        "rule_out_questions": {
            "r1": "Is the problem better explained by another non-sexual mental disorder? (e.g., Major Depression, severe anxiety)",
            "r2": "Is it due to significant relationship distress or partner violence?",
            "r3": "Is it a consequence of a substance/medication? (e.g., antidepressants, alcohol, blood pressure medication)",
            "r4": "Is it due to a medical condition? (e.g., diabetes, heart disease, hormonal imbalances, nerve damage)"
        },
        
        "diagnostic_indicators": {
            "female_sexual_interest_arousal_disorder": "q1_yes",
            "male_hypoactive_sexual_desire_disorder": "q1_yes", 
            "erectile_disorder": "q1a_yes_male",
            "female_orgasmic_disorder": "q2_yes_female",
            "delayed_ejaculation": "q2_yes_male OR q4_yes",
            "premature_early_ejaculation": "(q2a_yes AND q2b_yes) OR q4a_yes",
            "dyspareunia": "q3_yes AND q3a_yes",
            "gpppd": "q3_yes AND q3b_yes",
            "substance_medication_induced": "rule_out_r3_yes",
            "due_to_medical_condition": "rule_out_r4_yes"
        },
        
        "duration_requirement": "Symptoms must persist for at least 6 months and cause significant distress for formal diagnosis"
    }'

--SLEEP DISORDERS--
    {
        "sleep_disorder_screening": {
          "disclaimer": "This is a simplified screening tool for educational purposes only and NOT a diagnostic instrument. Sleep disorders require professional evaluation by a qualified healthcare provider.",
          
          "initial_question": "Which of these sleep problems do you experience persistently (at least 3 times per week for 3 months)?",
          
          "questions": {
            "q1": "Do you have difficulty falling asleep, staying asleep, or waking up too early without being able to return to sleep?",
            "q1a": "Do these sleep difficulties cause significant distress or impact your daytime functioning (e.g., fatigue, mood changes, concentration problems)?",
            
            "q2": "Has anyone told you that you snore loudly, gasp, choke, or stop breathing during sleep?",
            "q2a": "Do you wake up feeling unrefreshed despite spending adequate time in bed?",
            "q2b": "Do you experience excessive daytime sleepiness or fatigue?",
            
            "q3": "Do you experience uncomfortable sensations in your legs when trying to sleep?",
            "q3a": "Do you have an irresistible urge to move your legs that is relieved by movement?",
            "q3b": "Do these symptoms worsen in the evening or at night?"
          },
          
          "diagnostic_indicators": {
            "insomnia_disorder": "q1_yes AND q1a_yes",
            "sleep_apnea": "q2_yes AND (q2a_yes OR q2b_yes)",
            "restless_legs_syndrome": "q3_yes AND q3a_yes AND q3b_yes"
          },
          
          "recommendations": {
            "insomnia_disorder": "Consult a healthcare provider for cognitive behavioral therapy for insomnia (CBT-I) evaluation",
            "sleep_apnea": "Urgent consultation with a sleep specialist for possible sleep study",
            "restless_legs_syndrome": "Consult with a neurologist or sleep specialist for proper diagnosis and treatment"
          }
        }
      }

---LEARNING DISORDERS---
{
    "learning_disorder_screening": {
      "disclaimer": "This is a screening tool for educational purposes only and NOT a diagnostic instrument. Learning disorders require comprehensive evaluation by qualified professionals (psychologists, educational specialists, neurologists).",
      
      "initial_question": "What type of learning difficulty has been persistent and unexpected given the person's age, intelligence, and educational opportunities?",
      
      "questions": {
        "q1": "Does the individual have significant and persistent difficulties with reading skills that are inconsistent with their intellectual abilities?",
        "q1a": "Is there inaccurate or slow, effortful word reading?",
        "q1b": "Difficulty with reading comprehension?",
        "q1c": "Problems with spelling?",
        "q1d": "Do these difficulties persist despite targeted instruction and intervention?",
        
        "q2": "Does the individual have significant and persistent difficulties with written expression that are inconsistent with their intellectual abilities?",
        "q2a": "Problems with grammar, punctuation, or organization in writing?",
        "q2b": "Difficulty with clarity or coherence of written ideas?",
        "q2c": "Poor handwriting or trouble with letter formation?",
        "q2d": "Do these difficulties persist despite targeted instruction and intervention?",
        
        "q3": "Does the individual have significant and persistent difficulties with mathematical skills that are inconsistent with their intellectual abilities?",
        "q3a": "Problems with number sense, memorization of arithmetic facts, or calculation?",
        "q3b": "Difficulty with mathematical reasoning or problem-solving?",
        "q3c": "Trouble understanding mathematical concepts and relationships?",
        "q3d": "Do these difficulties persist despite targeted instruction and intervention?"
      },
      
      "rule_out_conditions": {
        "r1": "Are the difficulties better explained by intellectual disability, hearing/vision problems, or neurological disorders?",
        "r2": "Could the difficulties be due to inadequate educational instruction?",
        "r3": "Are the difficulties primarily due to psychosocial adversity or lack of language proficiency?",
        "r4": "Is there evidence that the difficulties began during school-age years?"
      },
      
      "diagnostic_indicators": {
        "dyslexia": "q1_yes AND (q1a_yes OR q1b_yes OR q1c_yes) AND q1d_yes",
        "dysgraphia": "q2_yes AND (q2a_yes OR q2b_yes OR q2c_yes) AND q2d_yes", 
        "dyscalculia": "q3_yes AND (q3a_yes OR q3b_yes OR q3c_yes) AND q3d_yes"
      },
      
      "associated_features": {
        "dyslexia": [
          "Avoidance of reading activities",
          "Fatigue when reading",
          "Difficulty learning foreign languages",
          "Family history of reading difficulties"
        ],
        "dysgraphia": [
          "Avoidance of writing tasks",
          "Inconsistent spacing and sizing of letters",
          "Difficulty organizing thoughts on paper",
          "Frustration with writing assignments"
        ],
        "dyscalculia": [
          "Anxiety about mathematics",
          "Difficulty with time concepts",
          "Trouble with money management",
          "Problems with spatial organization"
        ]
      },
      
      "age_considerations": "Symptoms must be present for at least 6 months and significantly interfere with academic or occupational performance",
      
      "next_steps": {
        "dyslexia": "Comprehensive psychoeducational assessment with focus on phonological processing and reading fluency",
        "dysgraphia": "Evaluation of fine motor skills, working memory, and written expression abilities", 
        "dyscalculia": "Assessment of number sense, calculation skills, and mathematical reasoning abilities"
      }
    }
  }

--TRAUMA/PANIC--
"trauma_panic_screening": {
    "disclaimer": "This is a screening tool for educational purposes only and NOT a diagnostic instrument. Trauma and anxiety disorders require professional evaluation by a qualified mental health provider.",
    
    "initial_question": "Have you experienced unexpected panic attacks or been exposed to a traumatic event?",
    
    "questions": {
      "q1": "Have you experienced recurrent, unexpected panic attacks?",
      "q1a": "Do you experience persistent concern or worry about having additional panic attacks?",
      "q1b": "Do you engage in significant maladaptive behavior related to the attacks (e.g., avoiding exercise, unfamiliar situations)?",
      "q1c": "Are these attacks not due to substance use or another medical condition?",
      
      "q2": "Have you been exposed to actual or threatened death, serious injury, or sexual violence?",
      "q2a": "Do you experience intrusive symptoms (flashbacks, nightmares, distressing memories)?",
      "q2b": "Do you avoid trauma-related stimuli (thoughts, feelings, people, places)?",
      "q2c": "Do you experience negative alterations in mood/cognition?",
      "q2d": "Do you experience marked arousal/reactivity (hypervigilance, startle response, sleep issues)?",
      "q2e": "Have these symptoms lasted more than one month?",
      
      "q3": "Have you experienced fear or anxiety about specific objects or situations?",
      "q3a": "Does exposure to the phobic stimulus almost always provoke immediate anxiety?",
      "q3b": "Do you actively avoid the phobic situation or endure it with intense anxiety?",
      "q3c": "Is the fear out of proportion to the actual danger?",
      "q3d": "Have these symptoms persisted for 6 months or more?"
    },
    
    "diagnostic_indicators": {
      "panic_disorder": "q1_yes AND q1a_yes AND (q1b_yes OR significant behavioral changes) AND q1c_yes",
      "ptsd": "q2_yes AND (q2a_yes OR q2b_yes) AND (q2c_yes OR q2d_yes) AND q2e_yes",
      "specific_phobia": "q3_yes AND q3a_yes AND q3b_yes AND q3c_yes AND q3d_yes"
    },
    
    "symptom_duration": {
      "panic_disorder": "Symptoms must persist for at least 1 month",
      "ptsd": "Symptoms must persist for at least 1 month", 
      "specific_phobia": "Symptoms must persist for at least 6 months"
    },
}

--SUBSTANCE--

"substance_use_screening": {
    "disclaimer": "This is a screening tool for educational purposes only and NOT a diagnostic instrument. Substance use disorders require professional evaluation by a qualified healthcare or addiction specialist.",
    
    "initial_question": "In the past 12 months, have you used alcohol, drugs, or nicotine/tobacco products?",
    
    "questions": {
      "q1": "Alcohol: Have you had times when you ended up drinking more, or longer, than you intended?",
      "q1a": "Alcohol: More than once wanted to cut down or stop drinking, or tried to, but couldn't?",
      "q1b": "Alcohol: Spent a lot of time drinking? Or being sick or getting over other aftereffects?",
      "q1c": "Alcohol: Found that drinking—or being sick from drinking—often interfered with taking care of your home or family? Or caused job troubles? Or school problems?",
      "q1d": "Alcohol: Given up or cut back on activities that were important or interesting to you, or gave you pleasure, in order to drink?",
      
      "q2": "Drugs: Have you used drugs in larger amounts or over a longer period than you intended?",
      "q2a": "Drugs: Experienced cravings or a strong desire to use drugs?",
      "q2b": "Drugs: Had withdrawal symptoms when you stopped using drugs?",
      "q2c": "Drugs: Continued to use drugs despite negative consequences on your relationships, work, or health?",
      "q2d": "Drugs: Given up important social, occupational, or recreational activities because of drug use?",
      
      "q3": "Nicotine: Do you smoke cigarettes or use other tobacco/nicotine products daily?",
      "q3a": "Nicotine: Do you experience strong cravings or urges to use nicotine?",
      "q3b": "Nicotine: Have you tried to quit or cut down but found it difficult?",
      "q3c": "Nicotine: Do you continue to use nicotine despite knowing it's causing health problems?",
      "q3d": "Nicotine: Do you experience withdrawal symptoms (irritability, anxiety, difficulty concentrating) when you don't use nicotine?"
    },
    
    "severity_indicators": {
      "alcohol_use_disorder": {
        "mild": "2-3 symptoms present",
        "moderate": "4-5 symptoms present", 
        "severe": "6+ symptoms present"
      },
      "drug_use_disorder": {
        "mild": "2-3 symptoms present",
        "moderate": "4-5 symptoms present",
        "severe": "6+ symptoms present"
      },
      "nicotine_use_disorder": {
        "mild": "2-3 symptoms present",
        "moderate": "4-5 symptoms present", 
        "severe": "6+ symptoms present"
      }
    },
    
    "diagnostic_criteria": {
      "alcohol_use_disorder": "At least 2 of q1-q1d symptoms within 12-month period",
      "drug_use_disorder": "At least 2 of q2-q2d symptoms within 12-month period",
      "nicotine_use_disorder": "At least 2 of q3-q3d symptoms within 12-month period"
    },
}





